HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxLmu_regdef.h
/** \brief LMU Region Upper Address Register */
typedef struct _Ifx_LMU_RGN_UA_Bits
{
    Ifx_UReg_32Bit reserved_0:5;      /**< \brief [4:0] \internal Reserved */
    Ifx_UReg_32Bit ADDR:27;           /**< \brief [31:5] Region Lower Address - ADDR (rw) */
} Ifx_LMU_RGN_UA_Bits;

/** \brief LMU Safety Control Register */
typedef struct _Ifx_LMU_SCTRL_Bits
{
    Ifx_UReg_32Bit GED:1;             /**< \brief [0:0] Generate Error in ECC for Data Protection - GED (w) */
    Ifx_UReg_32Bit GEC:1;             /**< \brief [1:1] Generate Error in ECC for Error Correction - GEC (w) */
    Ifx_UReg_32Bit reserved_2:6;      /**< \brief [7:2] \internal Reserved */
    Ifx_UReg_32Bit LSEN:2;            /**< \brief [9:8] Lockstep Enable (rw) */
    Ifx_UReg_32Bit LSTST:2;           /**< \brief [11:10] Lockstep Test (rw) */
    Ifx_UReg_32Bit reserved_12:4;     /**< \brief [15:12] \internal Reserved */
    Ifx_UReg_32Bit LSSTAT:2;          /**< \brief [17:16] Lockstep Status (rh) */
    Ifx_UReg_32Bit reserved_18:14;    /**< \brief [31:18] \internal Reserved */
} Ifx_LMU_SCTRL_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_lmu_Registers_union
 * \{   */
/** \brief LMU Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_ACCEN0_Bits B;            /**< \brief Bitfield access */
} Ifx_LMU_ACCEN0;

/** \brief LMU Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_ACCEN1_Bits B;            /**< \brief Bitfield access */
} Ifx_LMU_ACCEN1;

/** \brief LMU Clock Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_CLC_Bits B;               /**< \brief Bitfield access */
} Ifx_LMU_CLC;

/** \brief LMU Memory Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_MEMCON_Bits B;            /**< \brief Bitfield access */
} Ifx_LMU_MEMCON;

/** \brief LMU Module ID Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_MODID_Bits B;             /**< \brief Bitfield access */
} Ifx_LMU_MODID;

/** \brief LMU Region Read Access Enable Register A   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_RGNACCEN_RA_Bits B;       /**< \brief Bitfield access */
} Ifx_LMU_RGNACCEN_RA;

/** \brief LMU Region Read Access Enable Register B   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_RGNACCEN_RB_Bits B;       /**< \brief Bitfield access */
} Ifx_LMU_RGNACCEN_RB;

/** \brief LMU Region Write Access Enable Register A   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_RGN_ACCENA_Bits B;        /**< \brief Bitfield access */
} Ifx_LMU_RGN_ACCENA;

/** \brief LMU Region Write Access Enable Register B   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_RGN_ACCENB_Bits B;        /**< \brief Bitfield access */
} Ifx_LMU_RGN_ACCENB;

/** \brief LMU Region Lower Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_RGN_LA_Bits B;            /**< \brief Bitfield access */
} Ifx_LMU_RGN_LA;

/** \brief LMU Region Upper Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_RGN_UA_Bits B;            /**< \brief Bitfield access */
} Ifx_LMU_RGN_UA;

/** \brief LMU Safety Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_LMU_SCTRL_Bits B;             /**< \brief Bitfield access */
} Ifx_LMU_SCTRL;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Lmu_RGN_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief RGN object */
typedef volatile struct _Ifx_LMU_RGN
{
       Ifx_LMU_RGN_LA                      LA;                     /**< \brief 0, LMU Region Lower Address Register*/
       Ifx_LMU_RGN_UA                      UA;                     /**< \brief 4, LMU Region Upper Address Register*/
       Ifx_LMU_RGN_ACCENA                  ACCENA;                 /**< \brief 8, LMU Region Write Access Enable Register A*/
       Ifx_LMU_RGN_ACCENB                  ACCENB;                 /**< \brief C, LMU Region Write Access Enable Register B*/
} Ifx_LMU_RGN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Lmu_RGNACCEN_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief RGNACCEN object */
typedef volatile struct _Ifx_LMU_RGNACCEN
{
       Ifx_LMU_RGNACCEN_RA                 RA;                     /**< \brief 0, LMU Region Read Access Enable Register A*/
       Ifx_LMU_RGNACCEN_RB                 RB;                     /**< \brief 4, LMU Region Read Access Enable Register B*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_LMU_RGNACCEN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxSfr_Lmu_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

